::====================================================================================================
:: Description:                 FH 应用程序编译文件,若出错则编译立即停止
::                              
:: Author:                      YanDengxue, Fiberhome-Fuhua
::                              
:: History:                     Created at 2011.03.22
::                              
:: Version:                     1.00
::
:: Rev History:  
::       <Author>        <Data>        <Version>        <Description>
::     YanDengxue       2011-03-22       1.00              Create
::====================================================================================================
@set PATH=%CD%\..\Tools\CGTools\bin;%CD%\..\Tools;D:\FHFiles\MSYS\mingw\bin;%SystemRoot%\system32
@set C6X_C_DIR=%CD%\..\Tools\CGTools\include;%CD%\..\Tools\CGTools\lib

@make all 
@set CMOPILE_RESULT=%ERRORLEVEL%
@if not "0"=="%CMOPILE_RESULT%" goto SHOW_COMPILE_ERRORS

@goto skip

::------------------------------------------------------------------------------
:: 编译错误显示错误提示
::------------------------------------------------------------------------------
:SHOW_COMPILE_ERRORS
@echo ==========================================================================
@echo *******************编译过程中发现错误,敬请请确认!谢谢!********************
@echo *******************如需帮助,请拨打:13995508371!***************************
@echo ==========================================================================
@pause


::==============================================================================
:: 结束
::==============================================================================
:skip
