/*****************************************************************************************************
* FileName:                    Debug.c
*
* Description:                 调试相关程序
*
* Author:                      YanDengxue, Fiberhome-Fuhua
*
* Rev History:
*       <Author>        <Data>        <Hardware>     <Version>        <Description>
*     YanDengxue   2011-03-29 15:30       --           1.00             Create
*****************************************************************************************************/
//====================================================================================================
// 本文件使用的头文件
//====================================================================================================
// 库头文件
#include <stdio.h>

// 自定义头文件
#include "UserTypesDef.h"
#include "Debug.h"
#include "C6747Register.h"
#include "SystemBase.h"

//====================================================================================================
// 函数实现
//====================================================================================================
//----------------------------------------------------------------------------------------------------
// 接口函数
//----------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------
//   Function: DebugSendChar
//      Input: char c: 待发送字符
//     Output: void
//     Return: char: 发送字符
//Description: 串口发送字符
//    <AUTHOR>        <MODIFYTIME>            <REASON>
//   YanDengxue     2011-03-21 16:30           Create
//----------------------------------------------------------------------------------------------------
char DebugSendChar(char c)
{
    while (0 == (pDEBUG->LSR & UART_LSR_THRE));// 等待发送fifo空
    (pDEBUG->THR) = c;

    return c;
}

//----------------------------------------------------------------------------------------------------
//   Function: DebugSendString
//      Input: char const *seq: 待发送字符串首地址
//     Output: void
//     Return: int32: 函数执行情况
//Description: 串口发送字符串
//    <AUTHOR>        <MODIFYTIME>            <REASON>
//   YanDengxue     2011-03-21 16:30           Create
//----------------------------------------------------------------------------------------------------
int32 DebugSendString(char const *seq)
{
    int32 i, j;

    j = 0;
    while ('\0' != seq[j])
    {
        // Send byte
        while (0 == (pDEBUG->LSR & UART_LSR_THRE));// 等待发送fifo空
        for (i = 0; (i < 0x10) && ('\0' != seq[j]); i++, j++)
        {
            (pDEBUG->THR) = seq[j];
        }
    }
    return 0;
}

